{
    "books": [
        {
            "bookId": "B1",
            "image": "src/assets/images/book-1.jpg",
            "alt": "Harry Potter and the Prisoner of Azkaban book cover",
            "title": "Harry Potter and the Prisoner of Azkaban",
            "author": "J.K.Rowling",
            "description": "The story follows Harry Potter during his third year at Hogwarts School of Witchcraft and Wizardry, where he learns that Sirius Black, an infamous wizard and convicted murderer, has escaped from the wizarding prison of Azkaban. As Harry delves into the mystery, aided by his friends Ron and Hermione, they encounter time travel, terrifying creatures called Dementors, and the truth about Harry's own past. Filled with adventure, friendship, and the complexities of the wizarding world, this captivating script takes readers on a thrilling magical journey.",
            "price": 10.99,
            "availableQuantity": 20,
            "totalQuantity": 50
        },
        {
            "bookId": "B2",
            "image": "src/assets/images/book-2.jpg",
            "alt": "Harry Potter and the Chamber of Secrets book cover",
            "title": "Harry Potter and the Chamber of Secrets",
            "author": "J.K.Rowling",
            "description": "'Harry Potter and the Chamber of Secrets' follows the second year of Harry Potter's adventures at Hogwarts School of Witchcraft and Wizardry. When strange events occur, including mysterious messages written on the walls and students being petrified, Harry and his friends Ron and Hermione delve into the mystery of the Chamber of Secrets. They discover that an ancient monster, the Basilisk, has been unleashed and is threatening the students. As Harry uncovers the truth behind the Chamber's secrets, he must confront his own abilities and face the dark forces that lurk within Hogwarts, ultimately saving the day once again.",
            "price": 15.5,
            "availableQuantity": 24,
            "totalQuantity": 80
        },
        {
            "bookId": "B3",
            "image": "src/assets/images/book-3.jpg",
            "alt": "Harry Potter and the Goblet of Fire book cover",
            "title": "Harry Potter and the Goblet of Fire",
            "author": "J.K.Rowling",
            "description": "Harry Potter's world takes a dramatic turn. As he enters his fourth year at Hogwarts School of Witchcraft and Wizardry, the school is abuzz with excitement over the Triwizard Tournament. However, Harry finds himself unexpectedly thrust into the competition when his name is mysteriously chosen, even though he is underage. As he faces perilous challenges and encounters new dangers, Harry realizes that darker forces are at play. With the return of Lord Voldemort, Harry's journey becomes a battle for survival, testing his courage and resolve like never before. Amidst this thrilling adventure, friendships are forged, secrets are unraveled, and the wizarding world braces itself for the impending darkness.",
            "price": 12.08,
            "availableQuantity": 32,
            "totalQuantity": 67
        },
        {
            "bookId": "B4",
            "image": "src/assets/images/book-4.jpg",
            "alt": "Harry Potter and the Order of the Phoenix book cover",
            "title": "Harry Potter and the Order of the Phoenix",
            "author": "J.K.Rowling",
            "description": "Harry Potter returns to Hogwarts School of Witchcraft and Wizardry for his fifth year. However, his time at Hogwarts is marred by the oppressive rule of Dolores Umbridge, a Ministry-appointed Defense Against the Dark Arts teacher. Frustrated by the lack of information and support from the adults, Harry takes matters into his own hands and forms Dumbledore's Army, a secret group to learn and practice defensive magic. Meanwhile, Harry begins experiencing disturbing visions, as Lord Voldemort's influence grows stronger. With the clandestine organization, Harry and his friends face challenges, confrontations, and the ultimate battle between good and evil",
            "price": 13.94,
            "availableQuantity": 27,
            "totalQuantity": 64
        },
        {
            "bookId": "B5",
            "image": "src/assets/images/book-5.jpg",
            "alt": "Harry Potter and the Half-Blood Prince book cover",
            "title": "Harry Potter and the Half-Blood Prince",
            "author": "J.K.Rowling",
            "description": "Harry Potter enters his sixth year at Hogwarts School of Witchcraft and Wizardry. As the dark wizard Voldemort strengthens his forces, Hogwarts becomes a battleground for both magical and personal conflicts. With the guidance of Headmaster Albus Dumbledore, Harry delves into the mysterious past of Tom Riddle, the young Voldemort, and uncovers crucial information about Horcruxes—objects containing pieces of Voldemort's soul. As he navigates the challenges of teenage life, complicated relationships, and a growing sense of impending doom, Harry must gather the strength to face his destiny and prepare for the ultimate confrontation with the Dark Lord",
            "price": 20.0,
            "availableQuantity": 47,
            "totalQuantity": 97
        },
        {
            "bookId": "B6",
            "image": "src/assets/images/book-6.jpg",
            "alt": "Harry Potter and the Deathly Hallows book cover",
            "title": "Harry Potter and the Deathly Hallows",
            "author": "J.K.Rowling",
            "description": "Harry Potter, Ron Weasley, and Hermione Granger embark on a dangerous quest to destroy Voldemort's Horcruxes—objects containing fragments of his soul. Separated from the safety of Hogwarts, they traverse a treacherous wizarding world filled with deceit, betrayal, and loss. As they uncover the truth about the Deathly Hallows, powerful magical artifacts, Harry learns about his own fate and the ultimate sacrifice he must make. With the wizarding community teetering on the brink of destruction, Harry's journey to confront Voldemort becomes a test of courage, loyalty, and the power of love.",
            "price": 24.13,
            "availableQuantity": 46,
            "totalQuantity": 67
        },
        {
            "bookId": "B7",
            "image": "src/assets/images/book-7.jpg",
            "alt": "Harry Potter and the Philosopher's Stone book cover",
            "title": "Harry Potter and the Philosopher's Stone",
            "author": "J.K.Rowling",
            "description": "Orphaned as a baby, Harry grows up with his cruel aunt and uncle, unaware of his magical heritage. Everything changes when he receives a letter inviting him to attend Hogwarts School of Witchcraft and Wizardry. As Harry begins his journey at Hogwarts, he discovers a hidden destiny intertwined with the dark wizard, Lord Voldemort. Alongside his new friends Ron and Hermione, Harry unravels secrets, battles magical creatures, and faces a climactic showdown with Voldemort, all while uncovering the true power of love and friendship.",
            "price": 21.43,
            "availableQuantity": 23,
            "totalQuantity": 45
        },
        {
            "bookId": "B8",
            "image": "src/assets/images/book-8.jpg",
            "alt": "Sherlock Holmes: A Study in Scarlet book cover",
            "title": "Sherlock Holmes: A Study in Scarlet",
            "author": "Arthur Conan Doyle",
            "description": "The story begins when Watson, an army doctor, moves into a shared apartment with Holmes in London. Soon, they become embroiled in a perplexing murder case involving a man found dead in an abandoned house with the word 'RACHE' written in blood on the wall. As Holmes applies his remarkable deductive skills, the investigation takes them through the dark alleys of London and eventually leads them to the Mormons in Utah. This thrilling tale combines mystery, intrigue, and Holmes' brilliant mind, establishing the foundation for many more captivating adventures to come.",
            "price": 20.04,
            "availableQuantity": 13,
            "totalQuantity": 76
        },
        {
            "bookId": "B9",
            "image": "src/assets/images/book-9.jpg",
            "alt": "Sherlock Holmes: The Sign of Four book cover",
            "title": "Sherlock Holmes: The Sign of Four",
            "author": "Arthur Conan Doyle",
            "description": "Sherlock Holmes and Dr. John Watson are confronted with a perplexing case. Miss Mary Morstan seeks their help in solving the mysterious disappearance of her father years ago and the subsequent receipt of valuable pearls from an anonymous sender. As Holmes delves into the intricate web of clues, it leads them on a journey through dark secrets, treachery, and revenge. The case becomes entangled with the Agra treasure, a long-lost fortune that triggers a race against time. With Holmes' astute observations and Watson's unwavering loyalty, they strive to unravel the truth and bring justice to those involved.",
            "price": 13.94,
            "availableQuantity": 24,
            "totalQuantity": 88
        },
        {
            "bookId": "B10",
            "image": "src/assets/images/book-10.jpg",
            "alt": "The Adventures of Sherlock Holmes book cover",
            "title": "The Adventures of Sherlock Holmes",
            "author": "Arthur Conan Doyle",
            "description": "Set in late 19th-century London, the book follows the brilliant detective Sherlock Holmes and his loyal friend Dr. John Watson as they solve perplexing mysteries. From stolen jewels to suspicious deaths, each case presents a unique puzzle for Holmes to unravel using his keen observational skills and deductive reasoning. The stories showcase Holmes' remarkable intellect, his uncanny ability to read people and situations, and his knack for solving the most baffling crimes.",
            "price": 17.94,
            "availableQuantity": 34,
            "totalQuantity": 52
        },
        {
            "bookId": "B11",
            "image": "src/assets/images/book-11.jpg",
            "alt": "The Memoirs of Sherlock Holmes book cover",
            "title": "The Memoirs of Sherlock Holmes",
            "author": "Arthur Conan Doyle",
            "description": " The book chronicles the remarkable adventures of the brilliant detective Sherlock Holmes and his trusted companion Dr. John Watson. From uncovering a secret society's dark plot to solving a perplexing locked-room murder, each story showcases Holmes' unparalleled deductive reasoning and keen observation skills. The collection also delves into Holmes' personal life, revealing his encounters with formidable adversaries and his unique approach to crime-solving.",
            "price": 19.94,
            "availableQuantity": 27,
            "totalQuantity": 46
        },
        {
            "bookId": "B12",
            "image": "src/assets/images/book-12.jpg",
            "alt": "Sherlock Holmes: The Hound of the Baskervilles book cover",
            "title": "Sherlock Holmes: The Hound of the Baskervilles",
            "author": "Arthur Conan Doyle",
            "description": "Set in the eerie moors of Dartmoor, England, the story follows the legendary detective Sherlock Holmes and his faithful companion Dr. John Watson as they investigate the curse haunting the Baskerville family. When Sir Charles Baskerville is found dead under mysterious circumstances, it is believed that a monstrous supernatural hound is responsible. As Holmes and Watson dig deeper into the case, they encounter a web of deceit, family secrets, and ancient legends. The duo races against time to uncover the truth and protect the sole heir of the Baskerville estate from a deadly fate.",
            "price": 23.9,
            "availableQuantity": 32,
            "totalQuantity": 65
        },
        {
            "bookId": "B13",
            "image": "src/assets/images/book-13.jpg",
            "alt": "The Return of Sherlock Holmes book cover",
            "title": "The Return of Sherlock Holmes",
            "author": "Arthur Conan Doyle",
            "description": "Set after Sherlock Holmes' presumed death at Reichenbach Falls, the book follows Holmes' unexpected return to London and his reuniting with Dr. John Watson. As Holmes resumes his detective work, he takes on a range of perplexing cases, including a missing racehorse, a stolen naval treaty, and a series of seemingly unconnected burglaries. With his trademark wit, keen observation, and astute reasoning, Holmes unravels the complex mysteries, baffling both Watson and readers with his incredible deductive abilities",
            "price": 18.94,
            "availableQuantity": 45,
            "totalQuantity": 76
        },
        {
            "bookId": "B14",
            "image": "src/assets/images/book-14.jpg",
            "alt": "Sherlock Holmes: The Valley of Fear book cover",
            "title": "Sherlock Holmes: The Valley of Fear",
            "author": "Arthur Conan Doyle",
            "description": "The story begins with Sherlock Holmes and Dr. John Watson receiving a mysterious cipher message warning of impending danger. As they delve into the case, they uncover a tangled web of murder, secret societies, and revenge. The investigation takes them from the gloomy moors of England to the dangerous criminal underworld of America. With Holmes' exceptional intellect and Watson's unwavering loyalty, they unravel the truth behind the enigmatic Valley of Fear.",
            "price": 19.25,
            "availableQuantity": 25,
            "totalQuantity": 45
        },
        {
            "bookId": "B15",
            "image": "src/assets/images/book-15.jpg",
            "alt": "Sherlock Holmes: His Last Bow book cover",
            "title": "Sherlock Holmes: His Last Bow",
            "author": "Arthur Conan Doyle",
            "description": "Set in the early 20th century, the book follows Sherlock Holmes and his trusted companion Dr. John Watson as they tackle their final cases before Holmes' retirement. From foiling a German spy ring to uncovering a sinister plot against the British government, each story presents Holmes with formidable challenges that test his unparalleled deductive skills.",
            "price": 18.94,
            "availableQuantity": 43,
            "totalQuantity": 76
        },
        {
            "bookId": "B16",
            "image": "src/assets/images/book-16.jpg",
            "alt": "Arsène Lupin, Gentleman-Thief book cover",
            "title": "Arsène Lupin, Gentleman-Thief",
            "author": "Maurice Leblanc",
            "description": "The book introduces the charming and enigmatic character of Arsène Lupin, a masterful thief with a sense of honor. Lupin embarks on daring heists and elaborate schemes, outwitting both the law and his rivals in the process. From stealing priceless jewels to outsmarting the police, Lupin's escapades are filled with intrigue, wit, and unexpected twists. The stories also reveal Lupin's complex personality and his complex relationship with the detective Ganimard, who is determined to catch him.",
            "price": 20.44,
            "availableQuantity": 29,
            "totalQuantity": 48
        },
        {
            "bookId": "B17",
            "image": "src/assets/images/book-17.jpg",
            "alt": "V for Vendetta book cover",
            "title": "V for Vendetta",
            "author": "Alan Moore",
            "description": " Set in a totalitarian future Britain, the story follows the enigmatic anarchist known only as 'V' and his quest for vengeance against the oppressive regime. V, wearing a Guy Fawkes mask, wages a one-man war against the government, using elaborate schemes and acts of sabotage to inspire the people to rise against their oppressors. Along the way, he forms an unlikely alliance with Evey Hammond, a young woman caught up in his world of rebellion.",
            "price": 20.02,
            "availableQuantity": 43,
            "totalQuantity": 68
        },
        {
            "bookId": "B18",
            "image": "src/assets/images/book-18.jpg",
            "alt": "Where Darkness Blooms book cover",
            "title": "Where Darkness Blooms",
            "author": "Andrea Hannah",
            "description": "Andrea Hannah's supernatural thriller, 'Where Darkness Blooms' delves into the eerie town of Bishop, where an endless field of sunflowers hides dark secrets. When three women vanish during a stormy night, the town's history of missing women resurfaces. Left behind, their daughters grapple with shattered lives and a terrible secret emerges at their mothers' memorial. As each girl confronts her own secrets and lies, they are haunted by the town's sinister past. With a weathervane whispering secrets to one, forbidden summer flings revealed, and a thirst for answers, the girls unknowingly find themselves at the mercy of a town founded on bloodlust.",
            "price": 17.44,
            "availableQuantity": 33,
            "totalQuantity": 54
        },
        {
            "bookId": "B19",
            "image": "src/assets/images/book-19.jpg",
            "alt": "Catch Me If You Can: The True Story of a Real Fake book cover",
            "title": "Catch Me If You Can: The True Story of a Real Fake",
            "author": "Frank W. Abagnale, Stan Redding",
            "description": "The book follows the incredible life of Abagnale, a con artist who successfully impersonated various professions, including a pilot, a doctor, and a lawyer, all before his 21st birthday. Abagnale's escapades involve forging checks worth millions of dollars, evading the FBI, and eluding capture across multiple countries. As the authorities chase him, Abagnale's cunning and ability to adapt to new identities keep him one step ahead. This thrilling and sometimes humorous memoir offers a glimpse into the mind of a masterful imposter and the high-stakes world of fraud.",
            "price": 26.08,
            "availableQuantity": 19,
            "totalQuantity": 32
        },
        {
            "bookId": "B20",
            "image": "src/assets/images/book-20.jpg",
            "alt": "Stars in an Italian Sky book cover",
            "title": "Stars in an Italian Sky",
            "author": "Jill Santopolo",
            "description": "In post-World War II Italy, Vincenzo and Giovanna, from different social backgrounds, meet and fall in love in Genoa in 1946. Their passionate relationship takes them on a journey through their minds, bodies, and the city, as well as Vincenzo's family vineyard. However, political turmoil forces them to choose opposing sides, leading to a betrayal and the end of their dreams. In New York in 2017, Cassandra and Luca are deeply in love, despite not fitting into each other's families. When Luca, an artist, decides to paint their grandparents, a hidden secret from the past emerges, altering everything they thought they knew.",
            "price": 23.94,
            "availableQuantity": 27,
            "totalQuantity": 44
        }
    ],
    "members": [
        {
            "memberId": "M1",
            "role": "Admin",
            "firstName": "Giang",
            "lastName": "Nguyen",
            "email": "giang.nguyen@asnet.com.vn",
            "phoneNumber": "+84882227474",
            "address": "Da Nang",
            "hiredBooks": [
                {
                    "bookId": "B20"
                }
            ]
        },
        {
            "memberId": "M2",
            "role": "Admin",
            "firstName": "Linh",
            "lastName": "Hoang",
            "email": "linh.hoang@asnet.com.vn",
            "phoneNumber": "+84945145255",
            "address": "Da Nang",
            "hiredBooks": [
                {
                    "bookId": "B17"
                },
                {
                    "bookId": "B6"
                }
            ]
        }
    ],
    "hireRequests": {
        "bookId": "B1",
        "memberId": "M1",
        "fromDate": "2023-03-21T08:52:13.000Z",
        "toDate": "2023-03-24T08:52:13.000Z",
        "status": "completed"
    }
}